cfd/case/0.orig/DR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      DR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inletXp
    {
        type            calculated;
        value           uniform 16.61;
    }

    inletXm
    {
        type            calculated;
        value           uniform 16.61;
    }

    inletYp
    {
        type            calculated;
        value           uniform 16.61;
    }

    inletYm
    {
        type            calculated;
        value           uniform 16.61;
    }
    return
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
