cfd/case/system/FOaverage
/*--------------------------------*- C++ -*----------------------------------*\
  시간평균 — 실측이 "3분 평균"이므로 시뮬도 평균값으로 비교해야 합니다.
  순간값끼리 비교하면 난류 요동 때문에 의미가 없습니다.

  평균 시작 시점은 준정상 도달 후로 잡습니다.
  이 공간의 명목 시정수 tau = 232 s (체적 96.7 m3, 25 CMM -> 15.5 ACH)
    endTime  900 -> 600 부터 평균 (마지막 300초, 약 1.3 tau)
    endTime 3600 -> 3000 부터
\*---------------------------------------------------------------------------*/

fieldAverage
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    timeStart       600;
    writeControl    writeTime;

    fields
    (
        U { mean on;  prime2Mean off; base time; }
        T { mean on;  prime2Mean off; base time; }
    );
}

// ************************************************************************* //
