cfd/case/system/FOprobes
/*--------------------------------*- C++ -*----------------------------------*\
  실측 대조점 — 온도계를 놓을 자리와 동일 좌표
  좌표계: 평벽 중앙이 원점(0,0), 곡면 쪽이 +y, 바닥이 z=0

    A ( 0.0, 2.0)  에어컨 바로 아래   — 가장 차가울 것
    B ( 3.5, 0.8)  오른쪽 구석       — 가장 따뜻할 것 (사각지대)
    C ( 0.0, 4.5)  곡면 벽 쪽        — 중간
    D (-3.5, 0.8)  왼쪽 구석         — B 와 대칭, 비슷해야 정상

  높이 0.1 / 1.1 / 1.7 m  (ISO 7726: 발목 / 선 사람 배 / 선 사람 머리)
  → 온도계가 적으면 1.1 m 만 써도 됩니다.
\*---------------------------------------------------------------------------*/

probes
{
    type            probes;
    libs            (sampling);

    writeControl    timeStep;
    writeInterval   25;

    fields          (T U);

    probeLocations
    (
        ( 0.0  2.0  0.1)   //  0  A-0.1
        ( 0.0  2.0  1.1)   //  1  A-1.1   ★ 기본
        ( 0.0  2.0  1.7)   //  2  A-1.7

        ( 3.5  0.8  0.1)   //  3  B-0.1
        ( 3.5  0.8  1.1)   //  4  B-1.1   ★ 기본
        ( 3.5  0.8  1.7)   //  5  B-1.7

        ( 0.0  4.5  0.1)   //  6  C-0.1
        ( 0.0  4.5  1.1)   //  7  C-1.1
        ( 0.0  4.5  1.7)   //  8  C-1.7

        (-3.5  0.8  0.1)   //  9  D-0.1
        (-3.5  0.8  1.1)   // 10  D-1.1
        (-3.5  0.8  1.7)   // 11  D-1.7
    );
}

// ************************************************************************* //
